marcelkottmann/esp32-javascript/components/esp32-javascript/esp32-javascript.c
/*
MIT License

Copyright (c) 2021 Marcel Kottmann

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#include "sdkconfig.h"
#include <stdio.h>
#include <string.h>
#include <stddef.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include <duktape.h>
#include "esp_event.h"
#include "esp_system.h"
#if CONFIG_IDF_TARGET_ESP32S2
#include "esp32s2/spiram.h"
#else
#include "esp32/spiram.h"
#endif
#include "esp_log.h"
#include "esp_newlib.h"
#include "nvs_flash.h"
#include "freertos/timers.h"
#include "nvs.h"
#include "esp32-hal-gpio.h"
#include "esp32-hal-ledc.h"
#include "pins_arduino.h"
#include "duk_module_node.h"
#include "esp32-javascript.h"
#include "esp32-js-log.h"
#include "libb64/cdecode.h"
#include "libb64/cencode.h"
#include "esp_ota_ops.h"
#include "esp_partition.h"

static const char *tag = "esp32-javascript";

// global task handle
TaskHandle_t task;
xQueueHandle el_event_queue;

bool flag = false;
bool spiramAvailable = false;
duk_context *ctx = NULL;

// only for debug purposes
bool DISABLE_EVENTS = false;

void fileLog(duk_context *ctx, log_level_t level, char *message)
{
    if (level >= INFO)
    {
        // append to logfile
        duk_eval_string(ctx, "typeof el_appendLogBuffer");
        if (strcmp(duk_get_string(ctx, -1), "function") == 0)
        {
            duk_push_string(ctx, "el_appendLogBuffer");
            duk_eval(ctx);
            duk_push_string(ctx, message);
            duk_push_uint(ctx, level);
            duk_call(ctx, 2);
        }
    }
}

void jslog(log_level_t level, const char *msg, ...)
{
    if (level < (5 - LOG_LOCAL_LEVEL))
    {
        return;
    }

    char *my_string;
    va_list argp;

    va_start(argp, msg);
    vasprintf(&my_string, msg, argp);
    va_end(argp);

    TaskHandle_t current = xTaskGetCurrentTaskHandle();

    if (ctx && current == task) // prevent race conditions with ctx from different tasks
    {
        if (level == DEBUG)
        {
            duk_push_string(ctx, "console.debug");
        }
        else if (level == INFO)
        {
            duk_push_string(ctx, "console.info");
        }
        else if (level == WARN)
        {
            duk_push_string(ctx, "console.warn");
        }
        else
        {
            duk_push_string(ctx, "console.error");
        }
        duk_eval(ctx); /* -> [ ... func ] */
        duk_push_string(ctx, my_string);
        duk_call(ctx, 1);
        //clear stack
        duk_pop(ctx);
    }
    else
    {
        char *message = spiram_malloc(strlen(my_string) + 1); // gets freed in el_readAndFreeString
        if (message == NULL)
        {
            ESP_LOGE(tag, "No memory to log message. Aborting...");
            abort();
        }

        strcpy(message, my_string);

        js_event_t event;
        js_eventlist_t events;
        events.events_len = 0;

        el_create_event(&event, EL_LOG_EVENT_TYPE, level, message);
        el_add_event(&events, &event);
        el_fire_events(&events);
    }
    free(my_string);
}

static duk_ret_t console_debug_binding(duk_context *ctx)
{
    char *message = duk_to_string(ctx, 0);
    ESP_LOGD(tag, "%s", message);
    fileLog(ctx, DEBUG, message);
    return 0;
}
static duk_ret_t console_info_binding(duk_context *ctx)
{
    char *message = duk_to_string(ctx, 0);
    ESP_LOGI(tag, "%s", message);
    fileLog(ctx, INFO, message);
    return 0;
}
static duk_ret_t console_warn_binding(duk_context *ctx)
{
    char *message = duk_to_string(ctx, 0);
    ESP_LOGW(tag, "%s", message);
    fileLog(ctx, WARN, message);
    return 0;
}
static duk_ret_t console_error_binding(duk_context *ctx)
{
    char *message = duk_to_string(ctx, 0);
    ESP_LOGE(tag, "%s", message);
    fileLog(ctx, ERROR, message);
    return 0;
}

void IRAM_ATTR el_add_event(js_eventlist_t *events, js_event_t *event)
{
    if (events->events_len >= MAX_EVENTS)
    {
        ESP_LOGE(tag, "Event list is full. Max event list size: %d => aborting.", MAX_EVENTS);
        abort();
    }
    events->events[events->events_len] = *event;
    events->events_len = events->events_len + 1;
}

void IRAM_ATTR el_fire_events(js_eventlist_t *events)
{
    if (DISABLE_EVENTS)
    {
        ESP_LOGW(tag, "Events are disabled. They will never be fired.");
    }
    else
    {
        if (events->events_len > 0)
        {
            // el_fire_events is called from ISR and logging leads to overflowing stack (sometimes)
            // e.g. in timer routines, because timer task has limited stack size. Discovered in
            // backtrace of ELF 00d57bf2ccbe7755
            // ESP_LOGD(tag, "Send %d events to queue...", events->events_len);
            int ret = xQueueSendFromISR(el_event_queue, events, NULL);
            if (ret != pdTRUE)
            {
                ESP_LOGE(tag, "Event queue is full... is something blocking the event loop?...aborting.");
                js_eventlist_t devents;
                int num = 0;
                while (xQueueReceive(el_event_queue, &devents, 0))
                {
                    for (int i = 0; i < devents.events_len; i++)
                    {
                        ESP_LOGE(tag, "Events num %i, event idx %i, type %i, status %i", num, i, devents.events[i].type, devents.events[i].status);
                    }
                    num++;
                }

