marcelkottmann/esp32-javascript/components/esp32-javascript/esp32-javascript.c
                abort();
            }
        }
    }
}

void IRAM_ATTR el_create_event(js_event_t *event, int type, int status, void *fd)
{
    event->type = type;
    event->status = status;
    event->fd = fd;
}

void IRAM_ATTR vTimerCallback(TimerHandle_t xTimer)
{
    js_event_t event;
    js_eventlist_t events;

    el_create_event(&event, EL_TIMER_EVENT_TYPE, (int)xTimer, 0);
    events.events_len = 0;
    el_add_event(&events, &event);
    el_fire_events(&events);
}

int createTimer(int timer_period_us)
{
    int interval = timer_period_us / portTICK_PERIOD_MS;

    TimerHandle_t tmr = xTimerCreate("", interval <= 0 ? 1 : interval, pdFALSE, NULL, vTimerCallback);

    if (tmr == NULL)
    {
        jslog(ERROR, "Could not create timer.");
        abort();
    }

    if (interval <= 0)
    {
        // fire event immediatley without starting the timer
        vTimerCallback(tmr);
    }
    else
    {
        if (xTimerStart(tmr, portMAX_DELAY) != pdPASS)
        {
            jslog(ERROR, "Timer start error");
        }
    }
    return (int)tmr;
}

static duk_ret_t el_load(duk_context *ctx)
{
    int ret = 0;
    esp_err_t err;

    const char *key = duk_to_string(ctx, 0);

    nvs_handle my_handle;
    err = nvs_open("esp32js2", NVS_READONLY, &my_handle);
    if (err == ESP_ERR_NVS_NOT_FOUND)
    {
        duk_push_undefined(ctx);
        return 1;
    }
    else if (err != ESP_OK)
    {
        jslog(ERROR, "Error (%d) opening NVS!", err);
        return -1;
    }

    size_t string_size;
    err = nvs_get_blob(my_handle, key, NULL, &string_size);
    if (err == ESP_ERR_NVS_NOT_FOUND)
    {
        duk_push_undefined(ctx);
        ret = 1;
    }
    else if (err != ESP_OK)
    {
        jslog(ERROR, "Cannot get key %s from storage, err=%d", key, err);
        ret = -1;
    }
    else
    {
        char *value = (char *)malloc(string_size);
        err = nvs_get_blob(my_handle, key, value, &string_size);
        if (err != ESP_OK)
        {
            jslog(ERROR, "Cannot get key %s from storage, err=%d", key, err);
            ret = -1;
        }
        else
        {
            duk_push_string(ctx, value);
            ret = 1;
        }
        free(value);
    }
    nvs_close(my_handle);
    return ret;
}

static duk_ret_t el_store(duk_context *ctx)
{
    int ret = 0;
    esp_err_t err;

    const char *key = duk_to_string(ctx, 0);
    if (strlen(key) > 15)
    {
        jslog(ERROR, "Keys may not be longer than 15 chars. Key '%s' is longer.", key);
        return -1;
    }

    const char *value = duk_to_string(ctx, 1);
    int len = strlen(value);
    if (len > (1984 - 1))
    {
        jslog(ERROR, "Values may not be longer than 1984 chars (including zero-termination). Current string length is %d", len);
        return -1;
    }

    jslog(DEBUG, "Opening Non-Volatile Storage (NVS) ... ");
    nvs_handle my_handle;
    err = nvs_open("esp32js2", NVS_READWRITE, &my_handle);
    if (err != ESP_OK)
    {
        jslog(ERROR, "Error (%d) opening NVS!", err);
        return -1;
    }

    err = nvs_set_blob(my_handle, key, (void *)value, len + 1);
    if (err != ESP_OK)
    {
        jslog(ERROR, "Cannot set key %s and value %s from storage, err=%d", key, value, err);
        ret = -1;
    }

    err = nvs_commit(my_handle);
    if (err != ESP_OK)
    {
        jslog(ERROR, "Cannot commit changes, err=%d", err);
        ret = -1;
    }
    nvs_close(my_handle);
    return ret;
}

static duk_ret_t native_delay(duk_context *ctx)
{
    int delay = duk_to_int32(ctx, 0);
    jslog(DEBUG, "Waiting %dms...", delay);
    if (delay < 0)
    {
        delay = 0;
    }
    vTaskDelay(delay / portTICK_PERIOD_MS);
    return 0;
}

static duk_ret_t el_createTimer(duk_context *ctx)
{
    int delay = duk_to_int32(ctx, 0);
    if (delay < 0)
    {
        delay = 0;
    }
    jslog(DEBUG, "Install timer to notify in  %dms.", delay);
    int handle = createTimer(delay);
    duk_push_int(ctx, handle);
    return 1;
}

static duk_ret_t el_removeTimer(duk_context *ctx)
{
    int handle = duk_to_int32(ctx, 0);
    xTimerDelete((TimerHandle_t)handle, portMAX_DELAY);
    return 0;
}

static void createConsole(duk_context *ctx)
{
    duk_idx_t obj_idx = duk_push_object(ctx);

    duk_push_c_function(ctx, console_info_binding, 1);
    duk_put_prop_string(ctx, obj_idx, "log");
    duk_push_c_function(ctx, console_debug_binding, 1);
    duk_put_prop_string(ctx, obj_idx, "debug");
    duk_push_boolean(ctx, DEBUG >= (5 - LOG_LOCAL_LEVEL));
    duk_put_prop_string(ctx, obj_idx, "isDebug");
    duk_push_c_function(ctx, console_info_binding, 1);
    duk_put_prop_string(ctx, obj_idx, "info");
    duk_push_boolean(ctx, INFO >= (5 - LOG_LOCAL_LEVEL));
    duk_put_prop_string(ctx, obj_idx, "isInfo");
    duk_push_c_function(ctx, console_warn_binding, 1);
    duk_put_prop_string(ctx, obj_idx, "warn");
    duk_push_boolean(ctx, WARN >= (5 - LOG_LOCAL_LEVEL));
    duk_put_prop_string(ctx, obj_idx, "isWarn");
    duk_push_c_function(ctx, console_error_binding, 1);
    duk_put_prop_string(ctx, obj_idx, "error");
    duk_push_boolean(ctx, ERROR >= (5 - LOG_LOCAL_LEVEL));
    duk_put_prop_string(ctx, obj_idx, "isError");

    duk_put_global_string(ctx, "console");
}

static duk_ret_t el_suspend(duk_context *ctx)
{
    // feed watchdog
    vTaskDelay(1);

    // jslog(INFO, "Free memory: %d bytes", esp_get_free_heap_size());
    js_eventlist_t events;

    jslog(DEBUG, "Waiting for events...");
    int arr_idx = duk_push_array(ctx);
    int arrsize = 0;
    TickType_t timeout = portMAX_DELAY;

    // force garbage collection 2 times see duktape doc
    // greatly increases perfomance with external memory
    duk_gc(ctx, 0);
    duk_gc(ctx, 0);

    while (xQueueReceive(el_event_queue, &events, timeout) == pdTRUE)
    {
        timeout = 0; // set timeout to 0 to not wait in while loop if there are no more events available
        for (int i = 0; i < events.events_len; i++)
        {
            duk_idx_t obj_idx = duk_push_object(ctx);

            duk_push_int(ctx, events.events[i].type);
            duk_put_prop_string(ctx, obj_idx, "type");
            duk_push_int(ctx, events.events[i].status);
            duk_put_prop_string(ctx, obj_idx, "status");
            duk_push_int(ctx, (int)events.events[i].fd);
            duk_put_prop_string(ctx, obj_idx, "fd");

