marcelkottmann/esp32-javascript/components/esp32-javascript/esp32-javascript.c
            duk_put_prop_index(ctx, arr_idx, arrsize);
            arrsize++;
        }
    }

    jslog(DEBUG, "Received %d events.", arrsize);

    return 1;
}

static duk_ret_t el_pinMode(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);
    int dir = duk_to_int(ctx, 1);

    jslog(DEBUG, "el_pinMode pin=%d dir=%d", pin, dir);

    pinMode(pin, dir);
    return 0;
}

static duk_ret_t el_digitalWrite(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);
    int level = duk_to_int(ctx, 1);

    jslog(DEBUG, "el_digitalWrite pin=%d level=%d", pin, level);

    digitalWrite(pin, level);
    return 0;
}

static duk_ret_t el_digitalRead(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);

    jslog(DEBUG, "el_digitalRead pin=%d", pin);

    int val = digitalRead(pin);
    duk_push_int(ctx, val);
    return 1;
}

static duk_ret_t el_ledcSetup(duk_context *ctx)
{
    int channel = duk_to_int(ctx, 0);
    int freq = duk_to_int(ctx, 1);
    int resolution = duk_to_int(ctx, 2);

    jslog(DEBUG, "el_ledcSetup channel=%d freq=%d resolution=%d ", channel, freq, resolution);

    ledcSetup(channel, freq, resolution);
    return 0;
}

static duk_ret_t el_ledcAttachPin(duk_context *ctx)
{
    int pin = duk_to_int(ctx, 0);
    int channel = duk_to_int(ctx, 1);

    jslog(DEBUG, "el_ledcAttachPin pin=%d channel=%d", pin, channel);

    ledcAttachPin(pin, channel);
    return 0;
}

static duk_ret_t el_ledcWrite(duk_context *ctx)
{
    int channel = duk_to_int(ctx, 0);
    int dutyCycle = duk_to_int(ctx, 1);

    jslog(DEBUG, "el_ledcWrite channel=%d dutyCycle=%d ", channel, dutyCycle);

    ledcWrite(channel, dutyCycle);
    return 0;
}

static duk_ret_t info(duk_context *ctx)
{
    size_t internal = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
    size_t external = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);

    jslog(INFO, "INTERNAL MEMORY HEAP INFO FREE: %d", internal);
    jslog(INFO, "EXTERNAL MEMORY HEAP INFO FREE: %d", external);

    return 0;
}

static duk_ret_t el_restart(duk_context *ctx)
{
    esp_restart();
    return 0;
}

static void my_fatal(void *udata, const char *msg)
{
    (void)udata; /* ignored in this case, silence warning */

    /* Note that 'msg' may be NULL. */
    jslog(ERROR, "*** FATAL ERROR: %s", (msg ? msg : "no message"));
    abort();
}

static duk_ret_t setDateTimeInMillis(duk_context *ctx)
{
    double timeInMillis = duk_to_number(ctx, 0);
    struct timeval tv;
    tv.tv_sec = (time_t)(timeInMillis / (double)1000.0);
    tv.tv_usec = 0;
    settimeofday(&tv, NULL);
    return 0;
}

static duk_ret_t setDateTimeZoneOffsetInHours(duk_context *ctx)
{
    uint16_t offset = duk_to_uint16(ctx, 0);
    duk_dateTimeZoneOffsetInHours = offset;
    return 0;
}

void loadJS(duk_context *ctx, const char *name, char *start, char *end)
{
    const unsigned int length = end - start - 1;
    jslog(INFO, "Loading %s ...", name);
    duk_eval_lstring_noresult(ctx, start, length);
}

void loadUrlPolyfill(duk_context *ctx)
{
    extern char _start[] asm("_binary_urlparse_js_start");
    extern char _end[] asm("_binary_urlparse_js_end");
    loadJS(ctx, "urlparse.js", _start, _end);
}

duk_ret_t btoa(duk_context *ctx)
{
    const char *str = duk_to_string(ctx, 0);
    int length = strlen(str);
    size_t size = base64_encode_expected_len(length) + 1;
    char *buffer = (char *)spiram_malloc(size * sizeof(char));
    if (buffer)
    {
        base64_encodestate _state;
        base64_init_encodestate(&_state);
        int len = base64_encode_block((const char *)&str[0], length, &buffer[0], &_state);
        base64_encode_blockend((buffer + len), &_state);

        duk_push_lstring(ctx, buffer, size - 1);
        free(buffer);
        return 1;
    }
    jslog(ERROR, "malloc returned NULL");
    return -1;
}

duk_ret_t atob(duk_context *ctx)
{
    const char *str = duk_to_string(ctx, 0);
    int length = strlen(str);
    size_t size = base64_decode_expected_len(length);
    char *buffer = (char *)spiram_malloc(size);
    if (buffer)
    {
        base64_decodestate _state;
        base64_init_decodestate(&_state);
        base64_decode_block((const char *)&str[0], length, &buffer[0], &_state);

        duk_push_lstring(ctx, buffer, size);
        return 1;
    }
    jslog(ERROR, "malloc returned NULL");
    return -1;
}

IRAM_ATTR void *duk_spiram_malloc(void *udata, size_t size)
{
    if (spiramAvailable)
    {
        return heap_caps_malloc(size, MALLOC_CAP_SPIRAM);
    }
    else
    {
        return malloc(size);
    }
}
IRAM_ATTR void *spiram_malloc(size_t size)
{
    return duk_spiram_malloc(NULL, size);
}

IRAM_ATTR void *duk_spiram_realloc(void *udata, void *ptr, size_t size)
{
    if (spiramAvailable)
    {
        return heap_caps_realloc(ptr, size, MALLOC_CAP_SPIRAM);
    }
    else
    {
        return realloc(ptr, size);
    }
}
IRAM_ATTR void *spiram_realloc(void *ptr, size_t size)
{
    return duk_spiram_realloc(NULL, ptr, size);
}

IRAM_ATTR void duk_spiram_free(void *udata, void *ptr)
{
    if (spiramAvailable)
    {
        heap_caps_free(ptr);
    }
    else
    {
        free(ptr);
    }
}
IRAM_ATTR void spiram_free(void *ptr)
{
    duk_spiram_free(NULL, ptr);
}

bool spiramAvail()
{
    void *ptr = heap_caps_malloc(1, MALLOC_CAP_SPIRAM);
    if (ptr != NULL)
    {
        heap_caps_free(ptr);
        return true;
    }
    return false;
}

duk_ret_t el_ota_begin(duk_context *ctx)
{
    esp_partition_t *partition = esp_ota_get_next_update_partition(NULL);
    esp_ota_handle_t handle;
    esp_err_t err = esp_ota_begin(partition, OTA_SIZE_UNKNOWN, &handle);
    if (err == ESP_OK)
    {
        duk_push_uint(ctx, handle);
        return 1;
    }
    else
    {
        jslog(ERROR, "esp_ota_begin returned error %i", err);
        return -1;
    }
}

duk_ret_t el_ota_write(duk_context *ctx)
{
    duk_size_t size;
    esp_ota_handle_t handle = duk_to_uint32(ctx, 0);
    void *data = duk_get_buffer_data(ctx, 1, &size);

    esp_err_t err = esp_ota_write(handle, data, size);
    if (err == ESP_OK)
    {
        return 0;
    }
    else
    {
        jslog(ERROR, "Error while ota write: %i", err);
        return -1;
    }
}

duk_ret_t el_ota_end(duk_context *ctx)
{
    esp_ota_handle_t handle = duk_to_uint32(ctx, 0);

    esp_err_t err = esp_ota_end(handle);
    if (err == ESP_OK)
    {
        return 0;
    }
    else
    {
        jslog(ERROR, "Error while ota end: %i", err);
        return -1;
    }
}

