marcelkottmann/esp32-javascript/components/esp32-javascript/esp32-javascript.c
duk_ret_t el_ota_switch_boot_partition(duk_context *ctx)
{
    esp_partition_t *partition = esp_ota_get_next_update_partition(NULL);
    esp_err_t err = esp_ota_set_boot_partition(partition);

    if (err == ESP_OK)
    {
        return 0;
    }
    else
    {
        jslog(ERROR, "Error while ota switching boot: %i", err);
        return -1;
    }
}

duk_ret_t el_ota_find_next_modules_partition(duk_context *ctx)
{
    esp_partition_t *partition = esp_ota_get_next_update_partition(NULL);
    const char *modulesLabel = strcmp(partition->label, "ota_1") == 0 ? "modules_1" : "modules";
    esp_partition_t *modulesPartition = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_SPIFFS, modulesLabel);
    if (modulesPartition != NULL)
    {
        duk_push_pointer(ctx, modulesPartition);
        return 1;
    }
    else
    {
        jslog(ERROR, "Next modules partition not found.");
        return -1;
    }
}

duk_ret_t el_find_partition(duk_context *ctx)
{
    char *label = duk_to_string(ctx, 0);
    esp_partition_t *partition = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_SPIFFS, label);
    if (partition != NULL)
    {
        duk_idx_t obj_idx = duk_push_object(ctx);

        duk_push_pointer(ctx, partition);
        duk_put_prop_string(ctx, obj_idx, "_ref");
        duk_push_uint(ctx, partition->size);
        duk_put_prop_string(ctx, obj_idx, "size");

        return 1;
    }
    else
    {
        jslog(ERROR, "Partition with label %s not found.", label);
        return -1;
    }
}

duk_ret_t el_partition_erase(duk_context *ctx)
{
    esp_partition_t *partition = duk_to_pointer(ctx, 0);
    esp_err_t err = esp_partition_erase_range(partition, 0, partition->size);
    if (err == ESP_OK)
    {
        return 0;
    }
    else
    {
        jslog(ERROR, "Error while erasing next modules partition: %i", err);
        return -1;
    }
}

duk_ret_t el_partition_write(duk_context *ctx)
{
    esp_partition_t *partition = duk_to_pointer(ctx, 0);
    size_t offset = duk_to_uint(ctx, 1);

    size_t size;
    void *data = duk_get_buffer_data(ctx, 2, &size);

    esp_err_t err = esp_partition_write(partition, offset, data, size);
    if (err == ESP_OK)
    {
        return 0;
    }
    else
    {
        jslog(ERROR, "Error while erasing next modules partition: %i", err);
        return -1;
    }
}

bool isNativeOtaSupported()
{
    if (esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_OTA, "otadata") == NULL)
    {
        return false;
    }
    else
    {
        return true;
    }
}

duk_ret_t el_is_native_ota_supported(duk_context *ctx)
{
    duk_push_boolean(ctx, isNativeOtaSupported());
    return 1;
}

duk_ret_t el_readAndFreeString(duk_context *ctx)
{
    char *str = duk_to_int(ctx, 0);
    duk_push_string(ctx, str);
    spiram_free(str);
    return 1;
}

void duktape_task(void *ignore)
{
    spiramAvailable = spiramAvail();
    ctx = duk_create_heap(duk_spiram_malloc, duk_spiram_realloc, duk_spiram_free, NULL, my_fatal);

    createConsole(ctx);

    duk_push_c_function(ctx, console_info_binding, 1 /*nargs*/);
    duk_put_global_string(ctx, "print");

    jslog(INFO, "Free memory: %d bytes", esp_get_free_heap_size());

    duk_push_int(ctx, INPUT);
    duk_put_global_string(ctx, "INPUT");

    duk_push_int(ctx, OUTPUT);
    duk_put_global_string(ctx, "OUTPUT");

#ifdef KEY_BUILTIN
    duk_push_int(ctx, KEY_BUILTIN);
#else
    duk_push_undefined(ctx);
#endif
    duk_put_global_string(ctx, "KEY_BUILTIN");

#ifdef LED_BUILTIN
    duk_push_int(ctx, LED_BUILTIN);
#else
    duk_push_undefined(ctx);
#endif
    duk_put_global_string(ctx, "LED_BUILTIN");

    duk_push_c_function(ctx, el_pinMode, 2 /*nargs*/);
    duk_put_global_string(ctx, "pinMode");

    duk_push_c_function(ctx, el_digitalRead, 1 /*nargs*/);
    duk_put_global_string(ctx, "digitalRead");

    duk_push_c_function(ctx, el_digitalWrite, 2 /*nargs*/);
    duk_put_global_string(ctx, "digitalWrite");

    duk_push_int(ctx, 1);
    duk_put_global_string(ctx, "HIGH");

    duk_push_int(ctx, 0);
    duk_put_global_string(ctx, "LOW");

    duk_push_c_function(ctx, info, 0 /*nargs*/);
    duk_put_global_string(ctx, "info");

    duk_push_c_function(ctx, el_suspend, 0 /*nargs*/);
    duk_put_global_string(ctx, "el_suspend");

    duk_push_c_function(ctx, el_createTimer, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_createTimer");

    duk_push_c_function(ctx, el_removeTimer, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_removeTimer");

    duk_push_c_function(ctx, el_load, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_load");

    duk_push_c_function(ctx, el_store, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_store");

    duk_push_c_function(ctx, el_restart, 0 /*nargs*/);
    duk_put_global_string(ctx, "restart");

    duk_push_c_function(ctx, el_ledcSetup, 3 /*nargs*/);
    duk_put_global_string(ctx, "ledcSetup");

    duk_push_c_function(ctx, el_ledcAttachPin, 2 /*nargs*/);
    duk_put_global_string(ctx, "ledcAttachPin");

    duk_push_c_function(ctx, el_ledcWrite, 2 /*nargs*/);
    duk_put_global_string(ctx, "ledcWrite");

    duk_push_c_function(ctx, setDateTimeInMillis, 1 /*nargs*/);
    duk_put_global_string(ctx, "setDateTimeInMillis");

    duk_push_c_function(ctx, setDateTimeZoneOffsetInHours, 1 /*nargs*/);
    duk_put_global_string(ctx, "setDateTimeZoneOffsetInHours");

    duk_push_c_function(ctx, btoa, 1 /*nargs*/);
    duk_put_global_string(ctx, "btoa");

    duk_push_c_function(ctx, atob, 1 /*nargs*/);
    duk_put_global_string(ctx, "atob");

    if (isNativeOtaSupported())
    {
        duk_push_c_function(ctx, el_ota_begin, 0 /*nargs*/);
        duk_put_global_string(ctx, "el_ota_begin");

        duk_push_c_function(ctx, el_ota_write, 2 /*nargs*/);
        duk_put_global_string(ctx, "el_ota_write");

        duk_push_c_function(ctx, el_ota_end, 1 /*nargs*/);
        duk_put_global_string(ctx, "el_ota_end");

        duk_push_c_function(ctx, el_ota_switch_boot_partition, 0 /*nargs*/);
        duk_put_global_string(ctx, "el_ota_switch_boot_partition");

        duk_push_c_function(ctx, el_ota_find_next_modules_partition, 0 /*nargs*/);
        duk_put_global_string(ctx, "el_ota_find_next_modules_partition");
    }

    duk_push_c_function(ctx, el_is_native_ota_supported, 0 /*nargs*/);
    duk_put_global_string(ctx, "el_is_native_ota_supported");

    duk_push_c_function(ctx, el_partition_erase, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_partition_erase");

    duk_push_c_function(ctx, el_partition_write, 3 /*nargs*/);
    duk_put_global_string(ctx, "el_partition_write");

    duk_push_c_function(ctx, el_find_partition, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_find_partition");

    duk_push_int(ctx, EL_TIMER_EVENT_TYPE);
    duk_put_global_string(ctx, "EL_TIMER_EVENT_TYPE");

    duk_push_int(ctx, EL_LOG_EVENT_TYPE);
    duk_put_global_string(ctx, "EL_LOG_EVENT_TYPE");

    duk_push_c_function(ctx, el_readAndFreeString, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_readAndFreeString");

    loadUrlPolyfill(ctx);

#define ESP32_JAVASCRIPT_EXTERN ESP32_JAVASCRIPT_EXTERN_REGISTER
#include "esp32-javascript-config.h"
#undef ESP32_JAVASCRIPT_EXTERN

    duk_eval_string_noresult(ctx, "require('esp32-javascript')");

#define ESP32_JAVASCRIPT_EXTERN ESP32_JAVASCRIPT_EXTERN_LOAD
#include "esp32-javascript-config.h"
#undef ESP32_JAVASCRIPT_EXTERN

    jslog(INFO, "Reaching end of event loop.");

    //Return from task is not allowed
    vTaskDelete(NULL);
}

int esp32_javascript_init()
{
    esp_log_level_set("*", ESP_LOG_ERROR);
    esp_log_level_set("wifi", ESP_LOG_WARN);
    esp_log_level_set("dhcpc", ESP_LOG_WARN);
    esp_log_level_set(tag, LOG_LOCAL_LEVEL);

    nvs_flash_init();
    tcpip_adapter_init();

    el_event_queue = xQueueCreate(256, sizeof(js_eventlist_t));
    jslog(INFO, "Free memory: %d bytes", esp_get_free_heap_size());

    xTaskCreatePinnedToCore(&duktape_task, "duktape_task", 24 * 1024, NULL, 5, &task, 0);
    return 0;
}
